% Нейронные сети 
% Лабораторная работа 1
% Программа диалогового задания гармонического сигнала и его визуализации

close all; clear all;

disp('-----------------------------------------------------');
disp('*** Программа визуализации гармонического сигнала ***');

% Ввод частоты и амплитуды сигнала
f0  = input('Введите частоту сигнала в герцах: ');
A   = input('Введите амплитуду сигнала в условных единицах: ');
phi = input('Введите фазу сигнала, рад: ');
NT  = input('Введите количество периодов наблюдения, ед.: ');
mvis = input('Введите коэффициент уменьшения интервала дискретизации: ');

% Вывод введенных данных
disp('-----------------------------------------------------');
disp('Введенные данные:');
disp(['Частота сигнала (Гц)                           = ' num2str(f0)]);
disp(['Амплитуда сигнала (усл.ед.)                    = ' num2str(A)]);
disp(['Фаза сигнала, рад                              = ' num2str(phi)]);
disp(['Количество периодов сигнала                    = ' num2str(NT)]);
disp(['Коэффициент уменьшения интервала дискретизации = ' num2str(mvis)]);
disp('-----------------------------------------------------');

w   = 2*pi*f0;    % Переход к круговой частоте (рад/сек)
T   = 1/f0;       % Период исходного сигнала (сек)
dtn = pi/w;       % Интервал дискретизации Найквиста (теорема Котельникова)
dtv = dtn/mvis;   % Интервал дискретизации, пригодный для визуализации

Tnab = NT*T;      % Интервал наблюдения (сек)
disp(['Интервал наблюдения = ' num2str(Tnab) ' сек']);
Nn=Tnab/dtn;      % Количество точек в интервале наблюдения для дискретизации Найквиста
Nv=Tnab/dtv;      % Количество точек в интервале наблюдения для интервала дискретизации, 
                  % пригодного для визуализации
disp(['Количество точек в интервале наблюдения для дискретизации Найквиста = ' num2str(Nn)]);
disp(['Количество точек в интервале наблюдения для интервала дискретизации, пригодного для визуализации, = ' num2str(Nv)]);

tn = dtn*(0:Nn-1); % Вектор времени (сек), дискретизированный
                   % в соответствии с критерием Найквиста
tv = dtv*(0:Nv-1); % и c интервалом дискретизации,
                   % пригодным для визуализации
y1n = A*cos(2*pi*f0*tn+phi);
y2n = A*sin(2*pi*f0*tn+phi);
                  % Вектора сигналов, дискретизированных
                  % в соответствии с критерием Найквиста
y1v = A*cos(2*pi*f0*tv+phi);
y2v = A*sin(2*pi*f0*tv+phi);
                  % Вектора сигналов, дискретизированных
                  % c интервалом дискретизации,
                  % пригодным для визуализации

figure(1);
subplot(2,2,1);
plot(tn,y1n,'r-*');
axis([0 Tnab -1.1*A 1.1*A]);
title('Дискретизация по Найквисту','FontName','Courier');
xlabel('Time, sec');
ylabel('Signal');
subplot(2,2,2);
plot(tv,y1v,'b');
axis([0 Tnab -1.1*A 1.1*A]);
title(['Дискретизация в ',num2str(mvis),' раз точнее'],'FontName','Courier');
xlabel('Time, sec');
ylabel('Signal');
subplot(2,2,3);
plot(tn,y2n,'r-*');
axis([0 Tnab -1.1*A 1.1*A]);
xlabel('Time, sec');
ylabel('Signal');
subplot(2,2,4);
plot(tv,y2v,'b');
axis([0 Tnab -1.1*A 1.1*A]);
xlabel('Time, sec');
ylabel('Signal');

disp('**********   Конец работы   **********');