%%Lab_3

%Матрица обучающих данных
obych=[6.70 11.36 25.65 50.44 95.13
95.13 183.35 380.44 766.18 1529.79
1529.79 3062.91	6154.61	12285.47 24591.12
24591.12 49147.42 98316.11 196603.04 393231.73
393231.73 786445.77 1572857.01 3145710.96 6291474.29
6291474.29 12582941.65	25165812.10 50331660.33	100663291.39];

%Матрица входных значений
vxod=obych(:,1:4);

%Матрица ожидаемых выходных значений
vixod=obych(:,5);

%Нейронная сеть для прогнозирования
prognoz=newff(minmax(vxod'),[5 1],{'logsig' 'purelin'});

%Обучение нейронной сети
prognoz=train(prognoz,vxod',vixod');

%Тестовая выборка для проверки результатов обучения
test =[7.05 12.36 27.86 50.36 97.24
97.24 197.67 391.95 779.73 1522.51
1522.51 3082.96 6147.71 12305.63 24577.07
24577.07 49151.13 98317.56 196594.93 39389.86];

test_vxod=test(:,1:4);
test_vixod=test(:,5);

sim(prognoz,test_vxod)
test_vixod
